Hi @sinbai 
It shows another error when I try out the correct storage container id format you provided.
### Error output
`Error: creating HDInsight Spark Cluster "spark2-stg-stream" (Resource Group "rg-stg-stream"): hdinsight.ClustersClient#Create: Failure sending request: StatusCode=400 -- Original Error: Code="BadRequest" Message="Resource ID is missing or invalid but required for storage account ststgstreamspark when NetworkProperties has ResourceProviderConnection set to Outbound. The ID takes format like /subscriptions/$SUBSCRIPTION_ID/resourceGroups/$RESOURCE_GROUP/providers/Microsoft.Storage/storageAccounts/$ACCOUNT_NAME and can be found in Storage Account Properties from Azure Portal"`
 
### Plan output
```
# module.hdi-stg-spark-stream.azurerm_hdinsight_spark_cluster.hid_spark_cluster will be created
  + resource "azurerm_hdinsight_spark_cluster" "hid_spark_cluster" {
      + cluster_version               = "4.0"
      + encryption_in_transit_enabled = (known after apply)
      + https_endpoint                = (known after apply)
      + id                            = (known after apply)
      + location                      = "southeastasia"
      + name                          = "xxxx"
      + resource_group_name           = "xxxx"
      + ssh_endpoint                  = (known after apply)
     

      + component_version {
          + spark = "2.4"
        }

      + gateway {
          + enabled  = true
          + password = (sensitive value)
          + username = "xxxx"
        }

      + network {
          + connection_direction = "Outbound"
          + private_link_enabled = false
        }

      ......
      + storage_account {
          + is_default           = true
          + storage_account_key  = (sensitive value)
          + storage_container_id = "https://ststgstreamspark.blob.core.windows.net/spark-test02"
        }
    }
```
